Show / Hide Table of Contents
Class PatchDevice
Abstract class of patch support/load
Inheritance
System.Object
OpenObject
OpenElementId
PatchDevice
PatchLoad
PatchSupport
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class PatchDevice : OpenElementId
Constructors
Improve this Doc   View Source
PatchDevice()
Constructor
Declaration
public PatchDevice()
Properties
Improve this Doc   View Source
GeomId
Id representing geometrical parts of Detail
Declaration
public int GeomId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MasterComponent
Master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterPoint
Master point 0 - 9
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Position
Offset between MasterPoint and patch support/load
Declaration
public Vector3D Position { get; set; }
Property Value
 Type |  Description
 Vector3D
 Improve this Doc
 View Source